RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/ef_ctrl_reg.h
/* 0x804 : ef_if_cyc_0 */
#define EF_CTRL_EF_IF_CYC_0_OFFSET     (0x804)
#define EF_CTRL_EF_IF_CYC_RD_DMY       EF_CTRL_EF_IF_CYC_RD_DMY
#define EF_CTRL_EF_IF_CYC_RD_DMY_POS   (0U)
#define EF_CTRL_EF_IF_CYC_RD_DMY_LEN   (6U)
#define EF_CTRL_EF_IF_CYC_RD_DMY_MSK   (((1U << EF_CTRL_EF_IF_CYC_RD_DMY_LEN) - 1) << EF_CTRL_EF_IF_CYC_RD_DMY_POS)
#define EF_CTRL_EF_IF_CYC_RD_DMY_UMSK  (~(((1U << EF_CTRL_EF_IF_CYC_RD_DMY_LEN) - 1) << EF_CTRL_EF_IF_CYC_RD_DMY_POS))
#define EF_CTRL_EF_IF_CYC_RD_DAT       EF_CTRL_EF_IF_CYC_RD_DAT
#define EF_CTRL_EF_IF_CYC_RD_DAT_POS   (6U)
#define EF_CTRL_EF_IF_CYC_RD_DAT_LEN   (6U)
#define EF_CTRL_EF_IF_CYC_RD_DAT_MSK   (((1U << EF_CTRL_EF_IF_CYC_RD_DAT_LEN) - 1) << EF_CTRL_EF_IF_CYC_RD_DAT_POS)
#define EF_CTRL_EF_IF_CYC_RD_DAT_UMSK  (~(((1U << EF_CTRL_EF_IF_CYC_RD_DAT_LEN) - 1) << EF_CTRL_EF_IF_CYC_RD_DAT_POS))
#define EF_CTRL_EF_IF_CYC_RD_ADR       EF_CTRL_EF_IF_CYC_RD_ADR
#define EF_CTRL_EF_IF_CYC_RD_ADR_POS   (12U)
#define EF_CTRL_EF_IF_CYC_RD_ADR_LEN   (6U)
#define EF_CTRL_EF_IF_CYC_RD_ADR_MSK   (((1U << EF_CTRL_EF_IF_CYC_RD_ADR_LEN) - 1) << EF_CTRL_EF_IF_CYC_RD_ADR_POS)
#define EF_CTRL_EF_IF_CYC_RD_ADR_UMSK  (~(((1U << EF_CTRL_EF_IF_CYC_RD_ADR_LEN) - 1) << EF_CTRL_EF_IF_CYC_RD_ADR_POS))
#define EF_CTRL_EF_IF_CYC_CS           EF_CTRL_EF_IF_CYC_CS
#define EF_CTRL_EF_IF_CYC_CS_POS       (18U)
#define EF_CTRL_EF_IF_CYC_CS_LEN       (6U)
#define EF_CTRL_EF_IF_CYC_CS_MSK       (((1U << EF_CTRL_EF_IF_CYC_CS_LEN) - 1) << EF_CTRL_EF_IF_CYC_CS_POS)
#define EF_CTRL_EF_IF_CYC_CS_UMSK      (~(((1U << EF_CTRL_EF_IF_CYC_CS_LEN) - 1) << EF_CTRL_EF_IF_CYC_CS_POS))
#define EF_CTRL_EF_IF_CYC_PD_CS_S      EF_CTRL_EF_IF_CYC_PD_CS_S
#define EF_CTRL_EF_IF_CYC_PD_CS_S_POS  (24U)
#define EF_CTRL_EF_IF_CYC_PD_CS_S_LEN  (8U)
#define EF_CTRL_EF_IF_CYC_PD_CS_S_MSK  (((1U << EF_CTRL_EF_IF_CYC_PD_CS_S_LEN) - 1) << EF_CTRL_EF_IF_CYC_PD_CS_S_POS)
#define EF_CTRL_EF_IF_CYC_PD_CS_S_UMSK (~(((1U << EF_CTRL_EF_IF_CYC_PD_CS_S_LEN) - 1) << EF_CTRL_EF_IF_CYC_PD_CS_S_POS))

/* 0x808 : ef_if_cyc_1 */
#define EF_CTRL_EF_IF_CYC_1_OFFSET     (0x808)
#define EF_CTRL_EF_IF_CYC_PI           EF_CTRL_EF_IF_CYC_PI
#define EF_CTRL_EF_IF_CYC_PI_POS       (0U)
#define EF_CTRL_EF_IF_CYC_PI_LEN       (6U)
#define EF_CTRL_EF_IF_CYC_PI_MSK       (((1U << EF_CTRL_EF_IF_CYC_PI_LEN) - 1) << EF_CTRL_EF_IF_CYC_PI_POS)
#define EF_CTRL_EF_IF_CYC_PI_UMSK      (~(((1U << EF_CTRL_EF_IF_CYC_PI_LEN) - 1) << EF_CTRL_EF_IF_CYC_PI_POS))
#define EF_CTRL_EF_IF_CYC_PP           EF_CTRL_EF_IF_CYC_PP
#define EF_CTRL_EF_IF_CYC_PP_POS       (6U)
#define EF_CTRL_EF_IF_CYC_PP_LEN       (8U)
#define EF_CTRL_EF_IF_CYC_PP_MSK       (((1U << EF_CTRL_EF_IF_CYC_PP_LEN) - 1) << EF_CTRL_EF_IF_CYC_PP_POS)
#define EF_CTRL_EF_IF_CYC_PP_UMSK      (~(((1U << EF_CTRL_EF_IF_CYC_PP_LEN) - 1) << EF_CTRL_EF_IF_CYC_PP_POS))
#define EF_CTRL_EF_IF_CYC_WR_ADR       EF_CTRL_EF_IF_CYC_WR_ADR
#define EF_CTRL_EF_IF_CYC_WR_ADR_POS   (14U)
#define EF_CTRL_EF_IF_CYC_WR_ADR_LEN   (6U)
#define EF_CTRL_EF_IF_CYC_WR_ADR_MSK   (((1U << EF_CTRL_EF_IF_CYC_WR_ADR_LEN) - 1) << EF_CTRL_EF_IF_CYC_WR_ADR_POS)
#define EF_CTRL_EF_IF_CYC_WR_ADR_UMSK  (~(((1U << EF_CTRL_EF_IF_CYC_WR_ADR_LEN) - 1) << EF_CTRL_EF_IF_CYC_WR_ADR_POS))
#define EF_CTRL_EF_IF_CYC_PS_CS        EF_CTRL_EF_IF_CYC_PS_CS
#define EF_CTRL_EF_IF_CYC_PS_CS_POS    (20U)
#define EF_CTRL_EF_IF_CYC_PS_CS_LEN    (6U)
#define EF_CTRL_EF_IF_CYC_PS_CS_MSK    (((1U << EF_CTRL_EF_IF_CYC_PS_CS_LEN) - 1) << EF_CTRL_EF_IF_CYC_PS_CS_POS)
#define EF_CTRL_EF_IF_CYC_PS_CS_UMSK   (~(((1U << EF_CTRL_EF_IF_CYC_PS_CS_LEN) - 1) << EF_CTRL_EF_IF_CYC_PS_CS_POS))
#define EF_CTRL_EF_IF_CYC_PD_CS_H      EF_CTRL_EF_IF_CYC_PD_CS_H
#define EF_CTRL_EF_IF_CYC_PD_CS_H_POS  (26U)
#define EF_CTRL_EF_IF_CYC_PD_CS_H_LEN  (6U)
#define EF_CTRL_EF_IF_CYC_PD_CS_H_MSK  (((1U << EF_CTRL_EF_IF_CYC_PD_CS_H_LEN) - 1) << EF_CTRL_EF_IF_CYC_PD_CS_H_POS)
#define EF_CTRL_EF_IF_CYC_PD_CS_H_UMSK (~(((1U << EF_CTRL_EF_IF_CYC_PD_CS_H_LEN) - 1) << EF_CTRL_EF_IF_CYC_PD_CS_H_POS))

/* 0x80C : ef_if_0_manual */
#define EF_CTRL_EF_IF_0_MANUAL_OFFSET       (0x80C)
#define EF_CTRL_EF_IF_A                     EF_CTRL_EF_IF_A
#define EF_CTRL_EF_IF_A_POS                 (0U)
#define EF_CTRL_EF_IF_A_LEN                 (10U)
#define EF_CTRL_EF_IF_A_MSK                 (((1U << EF_CTRL_EF_IF_A_LEN) - 1) << EF_CTRL_EF_IF_A_POS)
#define EF_CTRL_EF_IF_A_UMSK                (~(((1U << EF_CTRL_EF_IF_A_LEN) - 1) << EF_CTRL_EF_IF_A_POS))
#define EF_CTRL_EF_IF_PD                    EF_CTRL_EF_IF_PD
#define EF_CTRL_EF_IF_PD_POS                (10U)
#define EF_CTRL_EF_IF_PD_LEN                (1U)
#define EF_CTRL_EF_IF_PD_MSK                (((1U << EF_CTRL_EF_IF_PD_LEN) - 1) << EF_CTRL_EF_IF_PD_POS)
#define EF_CTRL_EF_IF_PD_UMSK               (~(((1U << EF_CTRL_EF_IF_PD_LEN) - 1) << EF_CTRL_EF_IF_PD_POS))
#define EF_CTRL_EF_IF_PS                    EF_CTRL_EF_IF_PS
#define EF_CTRL_EF_IF_PS_POS                (11U)
#define EF_CTRL_EF_IF_PS_LEN                (1U)
#define EF_CTRL_EF_IF_PS_MSK                (((1U << EF_CTRL_EF_IF_PS_LEN) - 1) << EF_CTRL_EF_IF_PS_POS)
#define EF_CTRL_EF_IF_PS_UMSK               (~(((1U << EF_CTRL_EF_IF_PS_LEN) - 1) << EF_CTRL_EF_IF_PS_POS))
#define EF_CTRL_EF_IF_STROBE                EF_CTRL_EF_IF_STROBE
#define EF_CTRL_EF_IF_STROBE_POS            (12U)
#define EF_CTRL_EF_IF_STROBE_LEN            (1U)
#define EF_CTRL_EF_IF_STROBE_MSK            (((1U << EF_CTRL_EF_IF_STROBE_LEN) - 1) << EF_CTRL_EF_IF_STROBE_POS)
#define EF_CTRL_EF_IF_STROBE_UMSK           (~(((1U << EF_CTRL_EF_IF_STROBE_LEN) - 1) << EF_CTRL_EF_IF_STROBE_POS))
#define EF_CTRL_EF_IF_PGENB                 EF_CTRL_EF_IF_PGENB
#define EF_CTRL_EF_IF_PGENB_POS             (13U)
#define EF_CTRL_EF_IF_PGENB_LEN             (1U)
#define EF_CTRL_EF_IF_PGENB_MSK             (((1U << EF_CTRL_EF_IF_PGENB_LEN) - 1) << EF_CTRL_EF_IF_PGENB_POS)
#define EF_CTRL_EF_IF_PGENB_UMSK            (~(((1U << EF_CTRL_EF_IF_PGENB_LEN) - 1) << EF_CTRL_EF_IF_PGENB_POS))
#define EF_CTRL_EF_IF_LOAD                  EF_CTRL_EF_IF_LOAD
#define EF_CTRL_EF_IF_LOAD_POS              (14U)
#define EF_CTRL_EF_IF_LOAD_LEN              (1U)
#define EF_CTRL_EF_IF_LOAD_MSK              (((1U << EF_CTRL_EF_IF_LOAD_LEN) - 1) << EF_CTRL_EF_IF_LOAD_POS)
#define EF_CTRL_EF_IF_LOAD_UMSK             (~(((1U << EF_CTRL_EF_IF_LOAD_LEN) - 1) << EF_CTRL_EF_IF_LOAD_POS))
#define EF_CTRL_EF_IF_CSB                   EF_CTRL_EF_IF_CSB
#define EF_CTRL_EF_IF_CSB_POS               (15U)
#define EF_CTRL_EF_IF_CSB_LEN               (1U)
#define EF_CTRL_EF_IF_CSB_MSK               (((1U << EF_CTRL_EF_IF_CSB_LEN) - 1) << EF_CTRL_EF_IF_CSB_POS)
#define EF_CTRL_EF_IF_CSB_UMSK              (~(((1U << EF_CTRL_EF_IF_CSB_LEN) - 1) << EF_CTRL_EF_IF_CSB_POS))
#define EF_CTRL_EF_IF_0_Q                   EF_CTRL_EF_IF_0_Q
#define EF_CTRL_EF_IF_0_Q_POS               (16U)
#define EF_CTRL_EF_IF_0_Q_LEN               (8U)
#define EF_CTRL_EF_IF_0_Q_MSK               (((1U << EF_CTRL_EF_IF_0_Q_LEN) - 1) << EF_CTRL_EF_IF_0_Q_POS)
#define EF_CTRL_EF_IF_0_Q_UMSK              (~(((1U << EF_CTRL_EF_IF_0_Q_LEN) - 1) << EF_CTRL_EF_IF_0_Q_POS))
#define EF_CTRL_EF_IF_PROT_CODE_MANUAL      EF_CTRL_EF_IF_PROT_CODE_MANUAL
#define EF_CTRL_EF_IF_PROT_CODE_MANUAL_POS  (24U)
#define EF_CTRL_EF_IF_PROT_CODE_MANUAL_LEN  (8U)
#define EF_CTRL_EF_IF_PROT_CODE_MANUAL_MSK  (((1U << EF_CTRL_EF_IF_PROT_CODE_MANUAL_LEN) - 1) << EF_CTRL_EF_IF_PROT_CODE_MANUAL_POS)
#define EF_CTRL_EF_IF_PROT_CODE_MANUAL_UMSK (~(((1U << EF_CTRL_EF_IF_PROT_CODE_MANUAL_LEN) - 1) << EF_CTRL_EF_IF_PROT_CODE_MANUAL_POS))

/* 0x810 : ef_if_0_status */
#define EF_CTRL_EF_IF_0_STATUS_OFFSET (0x810)
#define EF_CTRL_EF_IF_0_STATUS        EF_CTRL_EF_IF_0_STATUS
#define EF_CTRL_EF_IF_0_STATUS_POS    (0U)
#define EF_CTRL_EF_IF_0_STATUS_LEN    (32U)
#define EF_CTRL_EF_IF_0_STATUS_MSK    (((1U << EF_CTRL_EF_IF_0_STATUS_LEN) - 1) << EF_CTRL_EF_IF_0_STATUS_POS)
#define EF_CTRL_EF_IF_0_STATUS_UMSK   (~(((1U << EF_CTRL_EF_IF_0_STATUS_LEN) - 1) << EF_CTRL_EF_IF_0_STATUS_POS))

/* 0x814 : ef_if_cfg_0 */
#define EF_CTRL_EF_IF_CFG_0_OFFSET         (0x814)
#define EF_CTRL_EF_IF_SF_AES_MODE          EF_CTRL_EF_IF_SF_AES_MODE
#define EF_CTRL_EF_IF_SF_AES_MODE_POS      (0U)
#define EF_CTRL_EF_IF_SF_AES_MODE_LEN      (2U)
#define EF_CTRL_EF_IF_SF_AES_MODE_MSK      (((1U << EF_CTRL_EF_IF_SF_AES_MODE_LEN) - 1) << EF_CTRL_EF_IF_SF_AES_MODE_POS)
#define EF_CTRL_EF_IF_SF_AES_MODE_UMSK     (~(((1U << EF_CTRL_EF_IF_SF_AES_MODE_LEN) - 1) << EF_CTRL_EF_IF_SF_AES_MODE_POS))
#define EF_CTRL_EF_IF_AI_DIS               EF_CTRL_EF_IF_AI_DIS
#define EF_CTRL_EF_IF_AI_DIS_POS           (2U)
#define EF_CTRL_EF_IF_AI_DIS_LEN           (1U)
#define EF_CTRL_EF_IF_AI_DIS_MSK           (((1U << EF_CTRL_EF_IF_AI_DIS_LEN) - 1) << EF_CTRL_EF_IF_AI_DIS_POS)
#define EF_CTRL_EF_IF_AI_DIS_UMSK          (~(((1U << EF_CTRL_EF_IF_AI_DIS_LEN) - 1) << EF_CTRL_EF_IF_AI_DIS_POS))
#define EF_CTRL_EF_IF_CPU0_DIS             EF_CTRL_EF_IF_CPU0_DIS
#define EF_CTRL_EF_IF_CPU0_DIS_POS         (3U)
#define EF_CTRL_EF_IF_CPU0_DIS_LEN         (1U)
#define EF_CTRL_EF_IF_CPU0_DIS_MSK         (((1U << EF_CTRL_EF_IF_CPU0_DIS_LEN) - 1) << EF_CTRL_EF_IF_CPU0_DIS_POS)
#define EF_CTRL_EF_IF_CPU0_DIS_UMSK        (~(((1U << EF_CTRL_EF_IF_CPU0_DIS_LEN) - 1) << EF_CTRL_EF_IF_CPU0_DIS_POS))
#define EF_CTRL_EF_IF_SBOOT_EN             EF_CTRL_EF_IF_SBOOT_EN
#define EF_CTRL_EF_IF_SBOOT_EN_POS         (4U)
#define EF_CTRL_EF_IF_SBOOT_EN_LEN         (2U)
#define EF_CTRL_EF_IF_SBOOT_EN_MSK         (((1U << EF_CTRL_EF_IF_SBOOT_EN_LEN) - 1) << EF_CTRL_EF_IF_SBOOT_EN_POS)
#define EF_CTRL_EF_IF_SBOOT_EN_UMSK        (~(((1U << EF_CTRL_EF_IF_SBOOT_EN_LEN) - 1) << EF_CTRL_EF_IF_SBOOT_EN_POS))
#define EF_CTRL_EF_IF_UART_DIS             EF_CTRL_EF_IF_UART_DIS
#define EF_CTRL_EF_IF_UART_DIS_POS         (6U)
#define EF_CTRL_EF_IF_UART_DIS_LEN         (4U)
#define EF_CTRL_EF_IF_UART_DIS_MSK         (((1U << EF_CTRL_EF_IF_UART_DIS_LEN) - 1) << EF_CTRL_EF_IF_UART_DIS_POS)
#define EF_CTRL_EF_IF_UART_DIS_UMSK        (~(((1U << EF_CTRL_EF_IF_UART_DIS_LEN) - 1) << EF_CTRL_EF_IF_UART_DIS_POS))
#define EF_CTRL_EF_IF_BLE2_DIS             EF_CTRL_EF_IF_BLE2_DIS
#define EF_CTRL_EF_IF_BLE2_DIS_POS         (10U)
#define EF_CTRL_EF_IF_BLE2_DIS_LEN         (1U)
#define EF_CTRL_EF_IF_BLE2_DIS_MSK         (((1U << EF_CTRL_EF_IF_BLE2_DIS_LEN) - 1) << EF_CTRL_EF_IF_BLE2_DIS_POS)
#define EF_CTRL_EF_IF_BLE2_DIS_UMSK        (~(((1U << EF_CTRL_EF_IF_BLE2_DIS_LEN) - 1) << EF_CTRL_EF_IF_BLE2_DIS_POS))
#define EF_CTRL_EF_IF_M1542_DIS            EF_CTRL_EF_IF_M1542_DIS
#define EF_CTRL_EF_IF_M1542_DIS_POS        (11U)
#define EF_CTRL_EF_IF_M1542_DIS_LEN        (1U)
#define EF_CTRL_EF_IF_M1542_DIS_MSK        (((1U << EF_CTRL_EF_IF_M1542_DIS_LEN) - 1) << EF_CTRL_EF_IF_M1542_DIS_POS)
#define EF_CTRL_EF_IF_M1542_DIS_UMSK       (~(((1U << EF_CTRL_EF_IF_M1542_DIS_LEN) - 1) << EF_CTRL_EF_IF_M1542_DIS_POS))
#define EF_CTRL_EF_IF_SF_KEY_RE_SEL        EF_CTRL_EF_IF_SF_KEY_RE_SEL
#define EF_CTRL_EF_IF_SF_KEY_RE_SEL_POS    (12U)
#define EF_CTRL_EF_IF_SF_KEY_RE_SEL_LEN    (2U)
#define EF_CTRL_EF_IF_SF_KEY_RE_SEL_MSK    (((1U << EF_CTRL_EF_IF_SF_KEY_RE_SEL_LEN) - 1) << EF_CTRL_EF_IF_SF_KEY_RE_SEL_POS)
#define EF_CTRL_EF_IF_SF_KEY_RE_SEL_UMSK   (~(((1U << EF_CTRL_EF_IF_SF_KEY_RE_SEL_LEN) - 1) << EF_CTRL_EF_IF_SF_KEY_RE_SEL_POS))
#define EF_CTRL_EF_IF_SDU_DIS              EF_CTRL_EF_IF_SDU_DIS
#define EF_CTRL_EF_IF_SDU_DIS_POS          (14U)
#define EF_CTRL_EF_IF_SDU_DIS_LEN          (1U)
#define EF_CTRL_EF_IF_SDU_DIS_MSK          (((1U << EF_CTRL_EF_IF_SDU_DIS_LEN) - 1) << EF_CTRL_EF_IF_SDU_DIS_POS)
#define EF_CTRL_EF_IF_SDU_DIS_UMSK         (~(((1U << EF_CTRL_EF_IF_SDU_DIS_LEN) - 1) << EF_CTRL_EF_IF_SDU_DIS_POS))
#define EF_CTRL_EF_IF_BTDM_DIS             EF_CTRL_EF_IF_BTDM_DIS
#define EF_CTRL_EF_IF_BTDM_DIS_POS         (15U)
#define EF_CTRL_EF_IF_BTDM_DIS_LEN         (1U)
#define EF_CTRL_EF_IF_BTDM_DIS_MSK         (((1U << EF_CTRL_EF_IF_BTDM_DIS_LEN) - 1) << EF_CTRL_EF_IF_BTDM_DIS_POS)
#define EF_CTRL_EF_IF_BTDM_DIS_UMSK        (~(((1U << EF_CTRL_EF_IF_BTDM_DIS_LEN) - 1) << EF_CTRL_EF_IF_BTDM_DIS_POS))
#define EF_CTRL_EF_IF_WIFI_DIS             EF_CTRL_EF_IF_WIFI_DIS
#define EF_CTRL_EF_IF_WIFI_DIS_POS         (16U)
#define EF_CTRL_EF_IF_WIFI_DIS_LEN         (1U)
#define EF_CTRL_EF_IF_WIFI_DIS_MSK         (((1U << EF_CTRL_EF_IF_WIFI_DIS_LEN) - 1) << EF_CTRL_EF_IF_WIFI_DIS_POS)
#define EF_CTRL_EF_IF_WIFI_DIS_UMSK        (~(((1U << EF_CTRL_EF_IF_WIFI_DIS_LEN) - 1) << EF_CTRL_EF_IF_WIFI_DIS_POS))
#define EF_CTRL_EF_IF_0_KEY_ENC_EN         EF_CTRL_EF_IF_0_KEY_ENC_EN
#define EF_CTRL_EF_IF_0_KEY_ENC_EN_POS     (17U)
#define EF_CTRL_EF_IF_0_KEY_ENC_EN_LEN     (1U)
#define EF_CTRL_EF_IF_0_KEY_ENC_EN_MSK     (((1U << EF_CTRL_EF_IF_0_KEY_ENC_EN_LEN) - 1) << EF_CTRL_EF_IF_0_KEY_ENC_EN_POS)
#define EF_CTRL_EF_IF_0_KEY_ENC_EN_UMSK    (~(((1U << EF_CTRL_EF_IF_0_KEY_ENC_EN_LEN) - 1) << EF_CTRL_EF_IF_0_KEY_ENC_EN_POS))
#define EF_CTRL_EF_IF_CAM_DIS              EF_CTRL_EF_IF_CAM_DIS
#define EF_CTRL_EF_IF_CAM_DIS_POS          (18U)
#define EF_CTRL_EF_IF_CAM_DIS_LEN          (1U)
#define EF_CTRL_EF_IF_CAM_DIS_MSK          (((1U << EF_CTRL_EF_IF_CAM_DIS_LEN) - 1) << EF_CTRL_EF_IF_CAM_DIS_POS)
#define EF_CTRL_EF_IF_CAM_DIS_UMSK         (~(((1U << EF_CTRL_EF_IF_CAM_DIS_LEN) - 1) << EF_CTRL_EF_IF_CAM_DIS_POS))
#define EF_CTRL_EF_IF_M154_DIS             EF_CTRL_EF_IF_M154_DIS
#define EF_CTRL_EF_IF_M154_DIS_POS         (19U)
#define EF_CTRL_EF_IF_M154_DIS_LEN         (1U)
#define EF_CTRL_EF_IF_M154_DIS_MSK         (((1U << EF_CTRL_EF_IF_M154_DIS_LEN) - 1) << EF_CTRL_EF_IF_M154_DIS_POS)
#define EF_CTRL_EF_IF_M154_DIS_UMSK        (~(((1U << EF_CTRL_EF_IF_M154_DIS_LEN) - 1) << EF_CTRL_EF_IF_M154_DIS_POS))
#define EF_CTRL_EF_IF_CPU1_DIS             EF_CTRL_EF_IF_CPU1_DIS
#define EF_CTRL_EF_IF_CPU1_DIS_POS         (20U)
#define EF_CTRL_EF_IF_CPU1_DIS_LEN         (1U)
#define EF_CTRL_EF_IF_CPU1_DIS_MSK         (((1U << EF_CTRL_EF_IF_CPU1_DIS_LEN) - 1) << EF_CTRL_EF_IF_CPU1_DIS_POS)
#define EF_CTRL_EF_IF_CPU1_DIS_UMSK        (~(((1U << EF_CTRL_EF_IF_CPU1_DIS_LEN) - 1) << EF_CTRL_EF_IF_CPU1_DIS_POS))
#define EF_CTRL_EF_IF_CPU_RST_DBG_DIS      EF_CTRL_EF_IF_CPU_RST_DBG_DIS
#define EF_CTRL_EF_IF_CPU_RST_DBG_DIS_POS  (21U)
#define EF_CTRL_EF_IF_CPU_RST_DBG_DIS_LEN  (1U)
#define EF_CTRL_EF_IF_CPU_RST_DBG_DIS_MSK  (((1U << EF_CTRL_EF_IF_CPU_RST_DBG_DIS_LEN) - 1) << EF_CTRL_EF_IF_CPU_RST_DBG_DIS_POS)
#define EF_CTRL_EF_IF_CPU_RST_DBG_DIS_UMSK (~(((1U << EF_CTRL_EF_IF_CPU_RST_DBG_DIS_LEN) - 1) << EF_CTRL_EF_IF_CPU_RST_DBG_DIS_POS))
#define EF_CTRL_EF_IF_SE_DBG_DIS           EF_CTRL_EF_IF_SE_DBG_DIS
#define EF_CTRL_EF_IF_SE_DBG_DIS_POS       (22U)
#define EF_CTRL_EF_IF_SE_DBG_DIS_LEN       (1U)
#define EF_CTRL_EF_IF_SE_DBG_DIS_MSK       (((1U << EF_CTRL_EF_IF_SE_DBG_DIS_LEN) - 1) << EF_CTRL_EF_IF_SE_DBG_DIS_POS)
#define EF_CTRL_EF_IF_SE_DBG_DIS_UMSK      (~(((1U << EF_CTRL_EF_IF_SE_DBG_DIS_LEN) - 1) << EF_CTRL_EF_IF_SE_DBG_DIS_POS))
#define EF_CTRL_EF_IF_EFUSE_DBG_DIS        EF_CTRL_EF_IF_EFUSE_DBG_DIS
#define EF_CTRL_EF_IF_EFUSE_DBG_DIS_POS    (23U)
#define EF_CTRL_EF_IF_EFUSE_DBG_DIS_LEN    (1U)
#define EF_CTRL_EF_IF_EFUSE_DBG_DIS_MSK    (((1U << EF_CTRL_EF_IF_EFUSE_DBG_DIS_LEN) - 1) << EF_CTRL_EF_IF_EFUSE_DBG_DIS_POS)
#define EF_CTRL_EF_IF_EFUSE_DBG_DIS_UMSK   (~(((1U << EF_CTRL_EF_IF_EFUSE_DBG_DIS_LEN) - 1) << EF_CTRL_EF_IF_EFUSE_DBG_DIS_POS))
#define EF_CTRL_EF_IF_DBG_JTAG_1_DIS       EF_CTRL_EF_IF_DBG_JTAG_1_DIS
#define EF_CTRL_EF_IF_DBG_JTAG_1_DIS_POS   (24U)
#define EF_CTRL_EF_IF_DBG_JTAG_1_DIS_LEN   (2U)
#define EF_CTRL_EF_IF_DBG_JTAG_1_DIS_MSK   (((1U << EF_CTRL_EF_IF_DBG_JTAG_1_DIS_LEN) - 1) << EF_CTRL_EF_IF_DBG_JTAG_1_DIS_POS)
#define EF_CTRL_EF_IF_DBG_JTAG_1_DIS_UMSK  (~(((1U << EF_CTRL_EF_IF_DBG_JTAG_1_DIS_LEN) - 1) << EF_CTRL_EF_IF_DBG_JTAG_1_DIS_POS))
#define EF_CTRL_EF_IF_DBG_JTAG_0_DIS       EF_CTRL_EF_IF_DBG_JTAG_0_DIS
#define EF_CTRL_EF_IF_DBG_JTAG_0_DIS_POS   (26U)
#define EF_CTRL_EF_IF_DBG_JTAG_0_DIS_LEN   (2U)
#define EF_CTRL_EF_IF_DBG_JTAG_0_DIS_MSK   (((1U << EF_CTRL_EF_IF_DBG_JTAG_0_DIS_LEN) - 1) << EF_CTRL_EF_IF_DBG_JTAG_0_DIS_POS)
#define EF_CTRL_EF_IF_DBG_JTAG_0_DIS_UMSK  (~(((1U << EF_CTRL_EF_IF_DBG_JTAG_0_DIS_LEN) - 1) << EF_CTRL_EF_IF_DBG_JTAG_0_DIS_POS))
#define EF_CTRL_EF_IF_DBG_MODE             EF_CTRL_EF_IF_DBG_MODE
#define EF_CTRL_EF_IF_DBG_MODE_POS         (28U)
#define EF_CTRL_EF_IF_DBG_MODE_LEN         (4U)
#define EF_CTRL_EF_IF_DBG_MODE_MSK         (((1U << EF_CTRL_EF_IF_DBG_MODE_LEN) - 1) << EF_CTRL_EF_IF_DBG_MODE_POS)
#define EF_CTRL_EF_IF_DBG_MODE_UMSK        (~(((1U << EF_CTRL_EF_IF_DBG_MODE_LEN) - 1) << EF_CTRL_EF_IF_DBG_MODE_POS))

